name = input("Введите ваше имя: ")

age = int(input("Введите ваш возраст: ")) 

if 0 < age < 75:
    
    if name != "Иван":
        
        if age >= 16:
            print("Поздравляем вы поступили в ВГУИТ")
            
        else:
            print("Сначала нужно окончить школу!")
            
            years_left = 16 - age
            print(f"Вам еще учиться в школе {years_left} лет.")
            
    else:
        print("Доступ заблокирован: имя не должно быть Иван.")
else:
    print("Ошибка: недопустимый возраст (должен быть от 1 до 74 лет).")
